grevaillot/svd_tools/headers/ATSAM4S4B/usart0.h
#define USART0_MR_CHRL_SHIFT		6
#define USART0_MR_CHRL_MASK		0x03
/** @defgroup usart0_mr_chrl CHRL Character Length
@{*/
/**@}*/


#define USART0_MR_USCLKS_SHIFT		4
#define USART0_MR_USCLKS_MASK		0x03
/** @defgroup usart0_mr_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART0_MR_USART_MODE_SHIFT		0
#define USART0_MR_USART_MODE_MASK		0x0f
/** @defgroup usart0_mr_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_mr_spi_mode MRSPIMODE Mode Register
@{*/

/** USART0_MR_SPI_MODE_WRDBT Wait Read Data Before Transfer **/
#define USART0_MR_SPI_MODE_WRDBT		(1 << 20)
/** USART0_MR_SPI_MODE_CLKO Clock Output Select **/
#define USART0_MR_SPI_MODE_CLKO		(1 << 18)
/** USART0_MR_SPI_MODE_CPOL SPI Clock Polarity **/
#define USART0_MR_SPI_MODE_CPOL		(1 << 16)
/** USART0_MR_SPI_MODE_CPHA SPI Clock Phase **/
#define USART0_MR_SPI_MODE_CPHA		(1 << 8)

#define USART0_MR_SPI_MODE_CHRL_SHIFT		6
#define USART0_MR_SPI_MODE_CHRL_MASK		0x03
/** @defgroup usart0_mr_spi_mode_chrl CHRL Character Length
@{*/
/**@}*/


#define USART0_MR_SPI_MODE_USCLKS_SHIFT		4
#define USART0_MR_SPI_MODE_USCLKS_MASK		0x03
/** @defgroup usart0_mr_spi_mode_usclks USCLKS Clock Selection
@{*/
/**@}*/


#define USART0_MR_SPI_MODE_USART_MODE_SHIFT		0
#define USART0_MR_SPI_MODE_USART_MODE_MASK		0x0f
/** @defgroup usart0_mr_spi_mode_usart_mode USARTMODE USART Mode of Operation
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_ier IER Interrupt Enable Register
@{*/

/** USART0_IER_MANE Manchester Error Interrupt Enable **/
#define USART0_IER_MANE		(1 << 24)
/** USART0_IER_CTSIC Clear to Send Input Change Interrupt Enable **/
#define USART0_IER_CTSIC		(1 << 19)
/** USART0_IER_DCDIC Data Carrier Detect Input Change Interrupt Enable **/
#define USART0_IER_DCDIC		(1 << 18)
/** USART0_IER_DSRIC Data Set Ready Input Change Enable **/
#define USART0_IER_DSRIC		(1 << 17)
/** USART0_IER_RIIC Ring Indicator Input Change Enable **/
#define USART0_IER_RIIC		(1 << 16)
/** USART0_IER_NACK Non Acknowledge Interrupt Enable **/
#define USART0_IER_NACK		(1 << 13)
/** USART0_IER_RXBUFF Receive Buffer Full Interrupt Enable (available in all USART modes of operation) **/
#define USART0_IER_RXBUFF		(1 << 12)
/** USART0_IER_TXBUFE Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation) **/
#define USART0_IER_TXBUFE		(1 << 11)
/** USART0_IER_ITER Max number of Repetitions Reached Interrupt Enable **/
#define USART0_IER_ITER		(1 << 10)
/** USART0_IER_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_IER_TXEMPTY		(1 << 9)
/** USART0_IER_TIMEOUT Time-out Interrupt Enable **/
#define USART0_IER_TIMEOUT		(1 << 8)
/** USART0_IER_PARE Parity Error Interrupt Enable **/
#define USART0_IER_PARE		(1 << 7)
/** USART0_IER_FRAME Framing Error Interrupt Enable **/
#define USART0_IER_FRAME		(1 << 6)
/** USART0_IER_OVRE Overrun Error Interrupt Enable **/
#define USART0_IER_OVRE		(1 << 5)
/** USART0_IER_ENDTX End of Transmit Buffer Interrupt Enable (available in all USART modes of operation) **/
#define USART0_IER_ENDTX		(1 << 4)
/** USART0_IER_ENDRX End of Receive Buffer Interrupt Enable (available in all USART modes of operation) **/
#define USART0_IER_ENDRX		(1 << 3)
/** USART0_IER_RXBRK Receiver Break Interrupt Enable **/
#define USART0_IER_RXBRK		(1 << 2)
/** USART0_IER_TXRDY TXRDY Interrupt Enable **/
#define USART0_IER_TXRDY		(1 << 1)
/** USART0_IER_RXRDY RXRDY Interrupt Enable **/
#define USART0_IER_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_ier_spi_mode IERSPIMODE Interrupt Enable Register
@{*/

/** USART0_IER_SPI_MODE_RXBUFF Receive Buffer Full Interrupt Enable **/
#define USART0_IER_SPI_MODE_RXBUFF		(1 << 12)
/** USART0_IER_SPI_MODE_TXBUFE Transmit Buffer Empty Interrupt Enable **/
#define USART0_IER_SPI_MODE_TXBUFE		(1 << 11)
/** USART0_IER_SPI_MODE_UNRE SPI Underrun Error Interrupt Enable **/
#define USART0_IER_SPI_MODE_UNRE		(1 << 10)
/** USART0_IER_SPI_MODE_TXEMPTY TXEMPTY Interrupt Enable **/
#define USART0_IER_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_IER_SPI_MODE_OVRE Overrun Error Interrupt Enable **/
#define USART0_IER_SPI_MODE_OVRE		(1 << 5)
/** USART0_IER_SPI_MODE_ENDTX End of Transmit Buffer Interrupt Enable **/
#define USART0_IER_SPI_MODE_ENDTX		(1 << 4)
/** USART0_IER_SPI_MODE_ENDRX End of Receive Buffer Interrupt Enable **/
#define USART0_IER_SPI_MODE_ENDRX		(1 << 3)
/** USART0_IER_SPI_MODE_TXRDY TXRDY Interrupt Enable **/
#define USART0_IER_SPI_MODE_TXRDY		(1 << 1)
/** USART0_IER_SPI_MODE_RXRDY RXRDY Interrupt Enable **/
#define USART0_IER_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_idr IDR Interrupt Disable Register
@{*/

/** USART0_IDR_MANE Manchester Error Interrupt Disable **/
#define USART0_IDR_MANE		(1 << 24)
/** USART0_IDR_CTSIC Clear to Send Input Change Interrupt Disable **/
#define USART0_IDR_CTSIC		(1 << 19)
/** USART0_IDR_DCDIC Data Carrier Detect Input Change Interrupt Disable **/
#define USART0_IDR_DCDIC		(1 << 18)
/** USART0_IDR_DSRIC Data Set Ready Input Change Disable **/
#define USART0_IDR_DSRIC		(1 << 17)
/** USART0_IDR_RIIC Ring Indicator Input Change Disable **/
#define USART0_IDR_RIIC		(1 << 16)
/** USART0_IDR_NACK Non Acknowledge Interrupt Disable **/
#define USART0_IDR_NACK		(1 << 13)
/** USART0_IDR_RXBUFF Receive Buffer Full Interrupt Disable (available in all USART modes of operation) **/
#define USART0_IDR_RXBUFF		(1 << 12)
/** USART0_IDR_TXBUFE Transmit Buffer Empty Interrupt Disable (available in all USART modes of operation) **/
#define USART0_IDR_TXBUFE		(1 << 11)
/** USART0_IDR_ITER Max Number of Repetitions Reached Interrupt Disable **/
#define USART0_IDR_ITER		(1 << 10)
/** USART0_IDR_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART0_IDR_TXEMPTY		(1 << 9)
/** USART0_IDR_TIMEOUT Time-out Interrupt Disable **/
#define USART0_IDR_TIMEOUT		(1 << 8)
/** USART0_IDR_PARE Parity Error Interrupt Disable **/
#define USART0_IDR_PARE		(1 << 7)
/** USART0_IDR_FRAME Framing Error Interrupt Disable **/
#define USART0_IDR_FRAME		(1 << 6)
/** USART0_IDR_OVRE Overrun Error Interrupt Enable **/
#define USART0_IDR_OVRE		(1 << 5)
/** USART0_IDR_ENDTX End of Transmit Buffer Interrupt Disable (available in all USART modes of operation) **/
#define USART0_IDR_ENDTX		(1 << 4)
/** USART0_IDR_ENDRX End of Receive Buffer Transfer Interrupt Disable (available in all USART modes of operation) **/
#define USART0_IDR_ENDRX		(1 << 3)
/** USART0_IDR_RXBRK Receiver Break Interrupt Disable **/
#define USART0_IDR_RXBRK		(1 << 2)
/** USART0_IDR_TXRDY TXRDY Interrupt Disable **/
#define USART0_IDR_TXRDY		(1 << 1)
/** USART0_IDR_RXRDY RXRDY Interrupt Disable **/
#define USART0_IDR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_idr_spi_mode IDRSPIMODE Interrupt Disable Register
@{*/

/** USART0_IDR_SPI_MODE_RXBUFF Receive Buffer Full Interrupt Disable **/
#define USART0_IDR_SPI_MODE_RXBUFF		(1 << 12)
/** USART0_IDR_SPI_MODE_TXBUFE Transmit Buffer Empty Interrupt Disable **/
#define USART0_IDR_SPI_MODE_TXBUFE		(1 << 11)
/** USART0_IDR_SPI_MODE_UNRE SPI Underrun Error Interrupt Disable **/
#define USART0_IDR_SPI_MODE_UNRE		(1 << 10)
/** USART0_IDR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART0_IDR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_IDR_SPI_MODE_OVRE Overrun Error Interrupt Disable **/
#define USART0_IDR_SPI_MODE_OVRE		(1 << 5)
/** USART0_IDR_SPI_MODE_ENDTX End of Transmit Buffer Interrupt Disable **/
#define USART0_IDR_SPI_MODE_ENDTX		(1 << 4)
/** USART0_IDR_SPI_MODE_ENDRX End of Receive Buffer Transfer Interrupt Disable **/
#define USART0_IDR_SPI_MODE_ENDRX		(1 << 3)
/** USART0_IDR_SPI_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART0_IDR_SPI_MODE_TXRDY		(1 << 1)
/** USART0_IDR_SPI_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART0_IDR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_imr IMR Interrupt Mask Register
@{*/

/** USART0_IMR_MANE Manchester Error Interrupt Mask **/
#define USART0_IMR_MANE		(1 << 24)
/** USART0_IMR_CTSIC Clear to Send Input Change Interrupt Mask **/
#define USART0_IMR_CTSIC		(1 << 19)
/** USART0_IMR_DCDIC Data Carrier Detect Input Change Interrupt Mask **/
#define USART0_IMR_DCDIC		(1 << 18)
/** USART0_IMR_DSRIC Data Set Ready Input Change Mask **/
#define USART0_IMR_DSRIC		(1 << 17)
/** USART0_IMR_RIIC Ring Indicator Input Change Mask **/
#define USART0_IMR_RIIC		(1 << 16)
/** USART0_IMR_NACK Non Acknowledge Interrupt Mask **/
#define USART0_IMR_NACK		(1 << 13)
/** USART0_IMR_RXBUFF Receive Buffer Full Interrupt Mask (available in all USART modes of operation) **/
#define USART0_IMR_RXBUFF		(1 << 12)
/** USART0_IMR_TXBUFE Transmit Buffer Empty Interrupt Mask (available in all USART modes of operation) **/
#define USART0_IMR_TXBUFE		(1 << 11)
/** USART0_IMR_ITER Max Number of Repetitions Reached Interrupt Mask **/
#define USART0_IMR_ITER		(1 << 10)
/** USART0_IMR_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_IMR_TXEMPTY		(1 << 9)
/** USART0_IMR_TIMEOUT Time-out Interrupt Mask **/
#define USART0_IMR_TIMEOUT		(1 << 8)
/** USART0_IMR_PARE Parity Error Interrupt Mask **/
#define USART0_IMR_PARE		(1 << 7)
/** USART0_IMR_FRAME Framing Error Interrupt Mask **/
#define USART0_IMR_FRAME		(1 << 6)
/** USART0_IMR_OVRE Overrun Error Interrupt Mask **/
#define USART0_IMR_OVRE		(1 << 5)
/** USART0_IMR_ENDTX End of Transmit Buffer Interrupt Mask (available in all USART modes of operation) **/
#define USART0_IMR_ENDTX		(1 << 4)
/** USART0_IMR_ENDRX End of Receive Buffer Interrupt Mask (available in all USART modes of operation) **/
#define USART0_IMR_ENDRX		(1 << 3)
/** USART0_IMR_RXBRK Receiver Break Interrupt Mask **/
#define USART0_IMR_RXBRK		(1 << 2)
/** USART0_IMR_TXRDY TXRDY Interrupt Mask **/
#define USART0_IMR_TXRDY		(1 << 1)
/** USART0_IMR_RXRDY RXRDY Interrupt Mask **/
#define USART0_IMR_RXRDY		(1 << 0)

/**@}*/

