grevaillot/svd_tools/headers/ATSAM4S4B/usart0.h
/** @defgroup usart0_imr_spi_mode IMRSPIMODE Interrupt Mask Register
@{*/

/** USART0_IMR_SPI_MODE_RXBUFF Receive Buffer Full Interrupt Mask **/
#define USART0_IMR_SPI_MODE_RXBUFF		(1 << 12)
/** USART0_IMR_SPI_MODE_TXBUFE Transmit Buffer Empty Interrupt Mask **/
#define USART0_IMR_SPI_MODE_TXBUFE		(1 << 11)
/** USART0_IMR_SPI_MODE_UNRE SPI Underrun Error Interrupt Mask **/
#define USART0_IMR_SPI_MODE_UNRE		(1 << 10)
/** USART0_IMR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART0_IMR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_IMR_SPI_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART0_IMR_SPI_MODE_OVRE		(1 << 5)
/** USART0_IMR_SPI_MODE_ENDTX End of Transmit Buffer Interrupt Mask **/
#define USART0_IMR_SPI_MODE_ENDTX		(1 << 4)
/** USART0_IMR_SPI_MODE_ENDRX End of Receive Buffer Interrupt Mask **/
#define USART0_IMR_SPI_MODE_ENDRX		(1 << 3)
/** USART0_IMR_SPI_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART0_IMR_SPI_MODE_TXRDY		(1 << 1)
/** USART0_IMR_SPI_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART0_IMR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_csr CSR Channel Status Register
@{*/

/** USART0_CSR_MANERR Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) **/
#define USART0_CSR_MANERR		(1 << 24)
/** USART0_CSR_CTS Image of CTS Input **/
#define USART0_CSR_CTS		(1 << 23)
/** USART0_CSR_DCD Image of DCD Input **/
#define USART0_CSR_DCD		(1 << 22)
/** USART0_CSR_DSR Image of DSR Input **/
#define USART0_CSR_DSR		(1 << 21)
/** USART0_CSR_RI Image of RI Input **/
#define USART0_CSR_RI		(1 << 20)
/** USART0_CSR_CTSIC Clear to Send Input Change Flag (cleared on read) **/
#define USART0_CSR_CTSIC		(1 << 19)
/** USART0_CSR_DCDIC Data Carrier Detect Input Change Flag (cleared on read) **/
#define USART0_CSR_DCDIC		(1 << 18)
/** USART0_CSR_DSRIC Data Set Ready Input Change Flag (cleared on read) **/
#define USART0_CSR_DSRIC		(1 << 17)
/** USART0_CSR_RIIC Ring Indicator Input Change Flag (cleared on read) **/
#define USART0_CSR_RIIC		(1 << 16)
/** USART0_CSR_NACK Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) **/
#define USART0_CSR_NACK		(1 << 13)
/** USART0_CSR_RXBUFF RX Buffer Full (cleared by writing US_RCR or US_RNCR) **/
#define USART0_CSR_RXBUFF		(1 << 12)
/** USART0_CSR_TXBUFE TX Buffer Empty (cleared by writing US_TCR or US_TNCR) **/
#define USART0_CSR_TXBUFE		(1 << 11)
/** USART0_CSR_ITER Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) **/
#define USART0_CSR_ITER		(1 << 10)
/** USART0_CSR_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART0_CSR_TXEMPTY		(1 << 9)
/** USART0_CSR_TIMEOUT Receiver Time-out (cleared by writing a one to bit US_CR.STTTO) **/
#define USART0_CSR_TIMEOUT		(1 << 8)
/** USART0_CSR_PARE Parity Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_CSR_PARE		(1 << 7)
/** USART0_CSR_FRAME Framing Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_CSR_FRAME		(1 << 6)
/** USART0_CSR_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_CSR_OVRE		(1 << 5)
/** USART0_CSR_ENDTX End of TX Buffer (cleared by writing US_TCR or US_TNCR) **/
#define USART0_CSR_ENDTX		(1 << 4)
/** USART0_CSR_ENDRX End of RX Buffer (cleared by writing US_RCR or US_RNCR) **/
#define USART0_CSR_ENDRX		(1 << 3)
/** USART0_CSR_RXBRK Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_CSR_RXBRK		(1 << 2)
/** USART0_CSR_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART0_CSR_TXRDY		(1 << 1)
/** USART0_CSR_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART0_CSR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_csr_spi_mode CSRSPIMODE Channel Status Register
@{*/

/** USART0_CSR_SPI_MODE_RXBUFF RX Buffer Full (cleared by writing US_RCR or US_RNCR) **/
#define USART0_CSR_SPI_MODE_RXBUFF		(1 << 12)
/** USART0_CSR_SPI_MODE_TXBUFE TX Buffer Empty (cleared by writing US_TCR or US_TNCR) **/
#define USART0_CSR_SPI_MODE_TXBUFE		(1 << 11)
/** USART0_CSR_SPI_MODE_UNRE Underrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_CSR_SPI_MODE_UNRE		(1 << 10)
/** USART0_CSR_SPI_MODE_TXEMPTY Transmitter Empty (cleared by writing US_THR) **/
#define USART0_CSR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART0_CSR_SPI_MODE_OVRE Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) **/
#define USART0_CSR_SPI_MODE_OVRE		(1 << 5)
/** USART0_CSR_SPI_MODE_ENDTX End of TX Buffer (cleared by writing US_TCR or US_TNCR) **/
#define USART0_CSR_SPI_MODE_ENDTX		(1 << 4)
/** USART0_CSR_SPI_MODE_ENDRX End of RX Buffer (cleared by writing US_RCR or US_RNCR) **/
#define USART0_CSR_SPI_MODE_ENDRX		(1 << 3)
/** USART0_CSR_SPI_MODE_TXRDY Transmitter Ready (cleared by writing US_THR) **/
#define USART0_CSR_SPI_MODE_TXRDY		(1 << 1)
/** USART0_CSR_SPI_MODE_RXRDY Receiver Ready (cleared by reading US_RHR) **/
#define USART0_CSR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart0_rhr RHR Receive Holding Register
@{*/

/** USART0_RHR_RXSYNH Received Sync **/
#define USART0_RHR_RXSYNH		(1 << 15)

#define USART0_RHR_RXCHR_SHIFT		0
#define USART0_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart0_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_thr THR Transmit Holding Register
@{*/

/** USART0_THR_TXSYNH Sync Field to be Transmitted **/
#define USART0_THR_TXSYNH		(1 << 15)

#define USART0_THR_TXCHR_SHIFT		0
#define USART0_THR_TXCHR_MASK		0x1ff
/** @defgroup usart0_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_brgr BRGR Baud Rate Generator Register
@{*/


#define USART0_BRGR_FP_SHIFT		16
#define USART0_BRGR_FP_MASK		0x07
/** @defgroup usart0_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART0_BRGR_CD_SHIFT		0
#define USART0_BRGR_CD_MASK		0xffff
/** @defgroup usart0_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rtor RTOR Receiver Time-out Register
@{*/


#define USART0_RTOR_TO_SHIFT		0
#define USART0_RTOR_TO_MASK		0xffff
/** @defgroup usart0_rtor_to TO Time-out Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_ttgr TTGR Transmitter Timeguard Register
@{*/


#define USART0_TTGR_TG_SHIFT		0
#define USART0_TTGR_TG_MASK		0xff
/** @defgroup usart0_ttgr_tg TG Timeguard Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_fidi FIDI FI DI Ratio Register
@{*/


