grevaillot/svd_tools/headers/ATSAM4S4B/usart0.h
#define USART0_FIDI_FI_DI_RATIO_SHIFT		0
#define USART0_FIDI_FI_DI_RATIO_MASK		0x7ff
/** @defgroup usart0_fidi_fi_di_ratio FIDIRATIO FI Over DI Ratio Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_ner NER Number of Errors Register
@{*/


#define USART0_NER_NB_ERRORS_SHIFT		0
#define USART0_NER_NB_ERRORS_MASK		0xff
/** @defgroup usart0_ner_nb_errors NBERRORS Number of Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_if IF IrDA Filter Register
@{*/


#define USART0_IF_IRDA_FILTER_SHIFT		0
#define USART0_IF_IRDA_FILTER_MASK		0xff
/** @defgroup usart0_if_irda_filter IRDAFILTER IrDA Filter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_man MAN Manchester Configuration Register
@{*/

/** USART0_MAN_DRIFT Drift Compensation **/
#define USART0_MAN_DRIFT		(1 << 30)
/** USART0_MAN_ONE Must Be Set to 1 **/
#define USART0_MAN_ONE		(1 << 29)
/** USART0_MAN_RX_MPOL Receiver Manchester Polarity **/
#define USART0_MAN_RX_MPOL		(1 << 28)

#define USART0_MAN_RX_PP_SHIFT		24
#define USART0_MAN_RX_PP_MASK		0x03
/** @defgroup usart0_man_rx_pp RXPP Receiver Preamble Pattern detected
@{*/
/**@}*/


#define USART0_MAN_RX_PL_SHIFT		16
#define USART0_MAN_RX_PL_MASK		0x0f
/** @defgroup usart0_man_rx_pl RXPL Receiver Preamble Length
@{*/
/**@}*/

/** USART0_MAN_TX_MPOL Transmitter Manchester Polarity **/
#define USART0_MAN_TX_MPOL		(1 << 12)

#define USART0_MAN_TX_PP_SHIFT		8
#define USART0_MAN_TX_PP_MASK		0x03
/** @defgroup usart0_man_tx_pp TXPP Transmitter Preamble Pattern
@{*/
/**@}*/


#define USART0_MAN_TX_PL_SHIFT		0
#define USART0_MAN_TX_PL_MASK		0x0f
/** @defgroup usart0_man_tx_pl TXPL Transmitter Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_wpmr WPMR Write Protection Mode Register
@{*/


#define USART0_WPMR_WPKEY_SHIFT		8
#define USART0_WPMR_WPKEY_MASK		0xffffff
/** @defgroup usart0_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** USART0_WPMR_WPEN Write Protection Enable **/
#define USART0_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup usart0_wpsr WPSR Write Protection Status Register
@{*/


#define USART0_WPSR_WPVSRC_SHIFT		8
#define USART0_WPSR_WPVSRC_MASK		0xffff
/** @defgroup usart0_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** USART0_WPSR_WPVS Write Protection Violation Status **/
#define USART0_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup usart0_rpr RPR Receive Pointer Register
@{*/


#define USART0_RPR_RXPTR_SHIFT		0
#define USART0_RPR_RXPTR_MASK		0xffffffff
/** @defgroup usart0_rpr_rxptr RXPTR Receive Pointer Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rcr RCR Receive Counter Register
@{*/


#define USART0_RCR_RXCTR_SHIFT		0
#define USART0_RCR_RXCTR_MASK		0xffff
/** @defgroup usart0_rcr_rxctr RXCTR Receive Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_tpr TPR Transmit Pointer Register
@{*/


#define USART0_TPR_TXPTR_SHIFT		0
#define USART0_TPR_TXPTR_MASK		0xffffffff
/** @defgroup usart0_tpr_txptr TXPTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_tcr TCR Transmit Counter Register
@{*/


#define USART0_TCR_TXCTR_SHIFT		0
#define USART0_TCR_TXCTR_MASK		0xffff
/** @defgroup usart0_tcr_txctr TXCTR Transmit Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rnpr RNPR Receive Next Pointer Register
@{*/


#define USART0_RNPR_RXNPTR_SHIFT		0
#define USART0_RNPR_RXNPTR_MASK		0xffffffff
/** @defgroup usart0_rnpr_rxnptr RXNPTR Receive Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_rncr RNCR Receive Next Counter Register
@{*/


#define USART0_RNCR_RXNCTR_SHIFT		0
#define USART0_RNCR_RXNCTR_MASK		0xffff
/** @defgroup usart0_rncr_rxnctr RXNCTR Receive Next Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_tnpr TNPR Transmit Next Pointer Register
@{*/


#define USART0_TNPR_TXNPTR_SHIFT		0
#define USART0_TNPR_TXNPTR_MASK		0xffffffff
/** @defgroup usart0_tnpr_txnptr TXNPTR Transmit Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_tncr TNCR Transmit Next Counter Register
@{*/


#define USART0_TNCR_TXNCTR_SHIFT		0
#define USART0_TNCR_TXNCTR_MASK		0xffff
/** @defgroup usart0_tncr_txnctr TXNCTR Transmit Counter Next
@{*/
/**@}*/


/**@}*/

/** @defgroup usart0_ptcr PTCR Transfer Control Register
@{*/

/** USART0_PTCR_TXTDIS Transmitter Transfer Disable **/
#define USART0_PTCR_TXTDIS		(1 << 9)
/** USART0_PTCR_TXTEN Transmitter Transfer Enable **/
#define USART0_PTCR_TXTEN		(1 << 8)
/** USART0_PTCR_RXTDIS Receiver Transfer Disable **/
#define USART0_PTCR_RXTDIS		(1 << 1)
/** USART0_PTCR_RXTEN Receiver Transfer Enable **/
#define USART0_PTCR_RXTEN		(1 << 0)

/**@}*/

/** @defgroup usart0_ptsr PTSR Transfer Status Register
@{*/

/** USART0_PTSR_TXTEN Transmitter Transfer Enable **/
#define USART0_PTSR_TXTEN		(1 << 8)
/** USART0_PTSR_RXTEN Receiver Transfer Enable **/
#define USART0_PTSR_RXTEN		(1 << 0)

/**@}*/
